{
  "LogicType.Activate": "1, wenn das Gerät aktiviert ist (bedeutet normalerweise, dass es läuft), sonst 0",
  "LogicType.AirRelease": "Der aktuelle Status des Luftablasssystems, z. B. AirRelease = 1 für einen Hardsuit setzt Air Release auf On",
  "LogicType.Charge": "Die aktuelle Ladung des Geräts",
  "LogicType.ClearMemory": "Wenn er auf 1 gesetzt wird, löscht er den Zählerspeicher (z. B. ExportCount). Setzt sich selbst auf 0 zurück, wenn die Aktion ausgeführt wird.",
  "LogicType.CollectableGoods": "Ermittelt die Treibstoffkosten, um die Rakete zu deiner aktuellen Welt zurückzubringen.",
  "LogicType.Color": "Ob aus Gründen der Übersichtlichkeit, der Sicherheit oder der einfachen Ästhetik, Stationeers haben Zugang zu einem kleinen Regenbogen von Farben für ihre Konstruktionen. Dies sind die Farbeinstellungen für Geräte, dargestellt als ganze Zahl.\n\n0: Blau\n1: Grau\n2: Grün\n3: Orange\n4: Rot\n5: Gelb\n6: Weiß\n7: Schwarz\n8: Braun\n9: Khaki\n10: Rosa\n11: Lila\n\n        Es ist ein unumstößliches universelles Gesetz, dass alles, was höher als 11 ist, lila ist. Der ODA ist machtlos, dies zu ändern. Genauso wird alles, was niedriger als 0 ist, blau sein.",
  "LogicType.Combustion": "Die Bewertung, ob die Atmosphäre in Flammen steht. Gibt 1 zurück, wenn die Atmosphäre brennt, 0, wenn nicht.",
  "LogicType.CombustionInput": "Die zu bewertende Atmosphäre brennt. Gibt 1 zurück, wenn das Eingangsnetzwerk des Geräts brennt, 0, wenn nicht.",
  "LogicType.CombustionInput2": "Die Bewertungsatmosphäre brennt. Gibt 1 zurück, wenn das Input2 Netzwerk des Geräts brennt, 0 wenn nicht.",
  "LogicType.CombustionLimiter": "Verlangsamt die Verbrennungsrate in der Maschine (Bereich: 0-100), wobei 0 die langsamste und 100 die schnellste Verbrennungsrate ist",
  "LogicType.CombustionOutput": "Die zu bewertende Atmosphäre brennt. Gibt 1 zurück, wenn das Netzwerk der Geräteausgabe brennt, 0, wenn nicht.",
  "LogicType.CombustionOutput2": "Die Bewertungsatmosphäre brennt. Gibt 1 zurück, wenn das Output2 Netzwerk des Geräts brennt, 0 wenn nicht.",
  "LogicType.CompletionRatio": "Wie vollständig die aktuelle Produktion für dieses Gerät ist, zwischen 0 und 1",
  "LogicType.ElevatorLevel": "Level, in dem sich der Aufzug gerade befindet",
  "LogicType.ElevatorSpeed": "Aktuelle Geschwindigkeit des Aufzugs",
  "LogicType.EnvironmentEfficiency": "Die von der Maschine gemeldete Umwelteffizienz, als Float zwischen 0 und 1",
  "LogicType.Error": "1, wenn sich das Gerät im Fehlerzustand befindet, sonst 0",
  "LogicType.ExportCount": "Wie viele Gegenstände seit dem letzten ClearMemory exportiert wurden",
  "LogicType.Filtration": "Der aktuelle Status des Filtersystems, z. B. Filtration = 1 für einen Hardsuit stellt die Filtration auf Ein",
  "LogicType.ForceWrite": "Zwingt die Logik-Schreiber-Geräte, den Wert neu zu schreiben",
  "LogicType.Fuel": "Ermittelt die Treibstoffkosten, um die Rakete zu deiner aktuellen Welt zurückzubringen.",
  "LogicType.Harvest": "Führt die Ernteaktion für eine beliebige pflanzliche Maschine durch",
  "LogicType.Horizontal": "Horizontale Einstellung des Geräts",
  "LogicType.HorizontalRatio": "Funkgerät für die horizontale Einstellung des Geräts",
  "LogicType.Idle": "Gibt 1 zurück, wenn sich das Gerät gerade im Leerlauf befindet, sonst 0",
  "LogicType.ImportCount": "Wie viele Gegenstände seit dem letzten ClearMemory importiert wurden",
  "LogicType.InterrogationProgress": "Der Fortschritt bei der Abfrage des aktuellen Ziels durch die Satellitenschüssel, als Verhältnis von 0-1",
  "LogicType.Lock": "1, wenn das Gerät gesperrt ist, sonst 0, kann bei den meisten Geräten eingestellt werden und verhindert, dass der Benutzer auf die Werte zugreifen kann",
  "LogicType.ManualResearchRequiredPod": "Legt den Pod-Typ fest, um nach einem bestimmten Pod zu suchen, wenn ein Pod abgebaut wird.",
  "LogicType.Maximum": "Maximale Einstellung des Geräts",
  "LogicType.MineablesInQueue": "Gibt die Menge an abbaubaren Materialien zurück, die AIMEe in der Warteschlange zum Abbau hat.",
  "LogicType.MineablesInVicinity": "Gibt die Anzahl der potenziellen Minen in einem erweiterten Gebiet um AIMEe zurück.",
  "LogicType.MinimumWattsToContact": "Die Mindestmenge an Watt, die von der Schüssel auf den Kontakt des Zielhändlers treffen muss, um die Abfrage des Kontakts zu starten",
  "LogicType.Mode": "Integerwert für den Betriebszustand, verschiedene Geräte haben unterschiedliche Betriebszustände zur Verfügung",
  "LogicType.NextWeatherEventTime": "Gibt in Sekunden zurück, wann das nächste Wetter Event eintrifft.",
  "LogicType.On": "Der aktuelle Zustand des Geräts, 0 für aus, 1 für an",
  "LogicType.Open": "1, wenn das Gerät geöffnet ist, sonst 0",
  "LogicType.OperationalTemperatureEfficiency": "Wie sich die Temperatur der Eingangsleitung auf die Effizienz der Maschine auswirkt",
  "LogicType.Output": "Die Ausgabe eines Sortiergeräts, z. B. eines Staplers oder Sortierers. Im Logikmodus führt das Gerät nur eine Wiederholung aus, wenn es auf Null oder höher eingestellt ist, und kehrt dann auf -1 zurück und wartet auf weitere Anweisungen.",
  "LogicType.Plant": "Führt die Pflanzaktion für alle pflanzlichen Maschinen aus",
  "LogicType.PositionX": "Die aktuelle Position in der X-Dimension in Weltkoordinaten",
  "LogicType.PositionY": "Die aktuelle Position in der Y-Dimension in Weltkoordinaten",
  "LogicType.PositionZ": "Die aktuelle Position in der Z-Dimension in Weltkoordinaten",
  "LogicType.Power": "Kann ausgelesen werden, um festzustellen, ob das Gerät korrekt mit Energie versorgt wird oder nicht, eingestellt über das Energiesystem, gibt 1 zurück, wenn es mit Energie versorgt wird und 0, wenn nicht",
  "LogicType.PowerActual": "Wie viel Energie das Gerät oder Netzwerk tatsächlich benutzt",
  "LogicType.PowerGeneration": "Gibt zurück, wie viel Energie erzeugt wird",
  "LogicType.PowerPotential": "Wie viel Energie das Gerät oder Netzwerk potenziell bereitstellt",
  "LogicType.PowerRequired": "Vom Gerät und/oder Netzwerk angeforderte Energie",
  "LogicType.PrefabHash": "Der Hash der Struktur",
  "LogicType.Pressure": "Der aktuelle Druckwert des Geräts",
  "LogicType.PressureEfficiency": "Wie sich der Druck des Eingangs- und des Abfallrohrs auf die Effizienz der Maschine auswirkt",
  "LogicType.PressureExternal": "Einstellung für die externe Drucksicherheit, in KPa",
  "LogicType.PressureInput": "Der aktuelle Druckwert des Eingangsnetzwerks des Geräts",
  "LogicType.PressureInput2": "Der aktuelle Druckwert des Input2 Netzwerks des Geräts",
  "LogicType.PressureInternal": "Einstellung für die interne Drucksicherheit, in KPa",
  "LogicType.PressureOutput": "Die aktuelle Druckanzeige des Netzwerks für die Ausgabe des Geräts",
  "LogicType.PressureOutput2": "Der aktuelle Druckwert des Output2 Netzwerks des Geräts",
  "LogicType.PressureSetting": "Die aktuelle Einstellung für den Innendruck des Objekts (z. B. der Hardsuit Air Release), in KPa",
  "LogicType.Quantity": "Gesamtmenge auf dem Gerät",
  "LogicType.Ratio": "Kontextspezifischer Wert je nach Gerät, 0 bis 1 basiertes Verhältnis",
  "LogicType.RatioCarbonDioxide": "Das Verhältnis von Kohlendioxid in der Geräteatmosphäre",
  "LogicType.RatioCarbonDioxideInput": "Das Verhältnis von Kohlendioxid im Eingangsnetzwerk des Geräts",
  "LogicType.RatioCarbonDioxideInput2": "Das Verhältnis von Kohlendioxid im Input2 Netzwerk des Geräts",
  "LogicType.RatioCarbonDioxideOutput": "Das Verhältnis von Kohlendioxid im Output Netzwerk des Geräts",
  "LogicType.RatioCarbonDioxideOutput2": "Das Verhältnis von Kohlendioxid im Output2 Netzwerk des Geräts",
  "LogicType.RatioNitrogen": "Das Verhältnis von Stickstoff in der Geräteatmosphäre",
  "LogicType.RatioNitrogenInput": "Das Verhältnis von Stickstoff im Eingangsnetzwerk des Geräts",
  "LogicType.RatioNitrogenInput2": "Das Verhältnis von Stickstoff im Input2 Netzwerk des Geräts",
  "LogicType.RatioNitrogenOutput": "Das Verhältnis von Stickstoff im Netzwerk Output des Geräts",
  "LogicType.RatioNitrogenOutput2": "Das Verhältnis von Stickstoff im Output2 Netzwerk des Geräts",
  "LogicType.RatioNitrousOxide": "Das Verhältnis von Distickstoffoxid in der Geräteatmosphäre",
  "LogicType.RatioNitrousOxideInput": "Das Verhältnis von Distickstoffoxid im Eingangsnetzwerk des Geräts",
  "LogicType.RatioNitrousOxideInput2": "Das Verhältnis von Distickstoffoxid im Input2 Netzwerk des Geräts",
  "LogicType.RatioNitrousOxideOutput": "Das Verhältnis von Distickstoffoxid im Netzwerk der Ausgabe des Geräts",
  "LogicType.RatioNitrousOxideOutput2": "Das Verhältnis von Distickstoffoxid im Output2 Netzwerk des Geräts",
  "LogicType.RatioOxygen": "Das Verhältnis von Sauerstoff in der Atmosphäre des Geräts",
  "LogicType.RatioOxygenInput": "Das Verhältnis von Sauerstoff im Eingangsnetzwerk des Geräts",
  "LogicType.RatioOxygenInput2": "Das Verhältnis von Sauerstoff im Input2 Netzwerk des Geräts",
  "LogicType.RatioOxygenOutput": "Das Verhältnis von Sauerstoff im Netzwerk der Ausgabe des Geräts",
  "LogicType.RatioOxygenOutput2": "Das Verhältnis von Sauerstoff im Output2 Netzwerk des Geräts",
  "LogicType.RatioPollutant": "Das Verhältnis von Schadstoffen in der Geräteatmosphäre",
  "LogicType.RatioPollutantInput": "Das Verhältnis der Schadstoffe im Eingangsnetzwerk des Geräts",
  "LogicType.RatioPollutantInput2": "Das Verhältnis der Schadstoffe im Input2 Netzwerk des Geräts",
  "LogicType.RatioPollutantOutput": "Das Verhältnis der Schadstoffe im Netzwerk der Ausgabe des Geräts",
  "LogicType.RatioPollutantOutput2": "Das Verhältnis der Schadstoffe im Output2 Netzwerk des Geräts",
  "LogicType.RatioVolatiles": "Das Verhältnis der flüchtigen Stoffe in der Geräteatmosphäre",
  "LogicType.RatioVolatilesInput": "Das Verhältnis der flüchtigen Stoffe im Eingangsnetzwerk des Geräts",
  "LogicType.RatioVolatilesInput2": "Das Verhältnis der flüchtigen Stoffe im Input2 Netzwerk des Geräts",
  "LogicType.RatioVolatilesOutput": "Das Verhältnis der flüchtigen Stoffe im Netzwerk der Ausgabe des Geräts",
  "LogicType.RatioVolatilesOutput2": "Das Verhältnis der flüchtigen Stoffe im Output2 Netzwerk des Geräts",
  "LogicType.RatioWater": "Das Verhältnis von Wasser in der Geräteatmosphäre",
  "LogicType.RatioWaterInput": "Das Verhältnis von Wasser im Eingangsnetzwerk des Geräts",
  "LogicType.RatioWaterInput2": "Das Verhältnis von Wasser im Input2 Netzwerk des Geräts",
  "LogicType.RatioWaterOutput": "Das Verhältnis von Wasser im Output Netzwerk des Geräts",
  "LogicType.RatioWaterOutput2": "Das Verhältnis von Wasser im Output2 Netzwerk des Geräts",
  "LogicType.Reagents": "Gesamtzahl der vom Gerät erfassten Reagenzien",
  "LogicType.RecipeHash": "Aktueller Hash des Rezepts, das das Gerät produzieren soll",
  "LogicType.RequestHash": "Wenn er auf den eindeutigen Bezeichner gesetzt ist, fordert er einen Gegenstand des angegebenen Typs vom Gerät an",
  "LogicType.RequiredPower": "Menge der Energie im Leerlauf, beinhaltet nicht notwendigerweise die Energie für den zusätzlichen Bedarf",
  "LogicType.ReturnFuelCost": "Liefert den verbleibenden Treibstoff im Treibstofftank deiner Rakete.",
  "LogicType.Rpm": "Die Anzahl der Umdrehungen pro Minute, die der Drehmechanismus des Geräts macht",
  "LogicType.Setting": "Eine variable Einstellung, die je nach Gerät gelesen oder geschrieben werden kann",
  "LogicType.SignalID": "Gibt die Kontakt-ID des stärksten Signals von diesem Satelliten zurück",
  "LogicType.SignalStrength": "Gibt den Grad-Offset des stärksten Kontakts zurück",
  "LogicType.SizeX": "Größe auf der X-Achse (rechts) des Objekts in largeGrids (ein largeGrid ist 2 Meter)",
  "LogicType.SizeY": "Größe auf der Y(Oben)-Achse des Objekts in largeGrids (ein largeGrid ist 2Meter)",
  "LogicType.SizeZ": "Größe auf der Z(Vorwärts)-Achse des Objekts in largeGrids (ein largeGrid ist 2 Meter)",
  "LogicType.SolarAngle": "Sonnenwinkel des Geräts",
  "LogicType.Stress": "Maschinen werden gestresst, wenn sie hart arbeiten. Wenn die Belastung 100 erreicht, schaltet sich die Maschine automatisch ab.",
  "LogicType.TargetPadIndex": "Der Index des Landeplatzes des Händlers im Netzwerk des Geräts, an dem es versucht, einen Händler zum Landen zu rufen",
  "LogicType.TargetX": "Die Zielposition in der X-Dimension in Weltkoordinaten",
  "LogicType.TargetY": "Die Zielposition in der Y-Dimension in Weltkoordinaten",
  "LogicType.TargetZ": "Die Zielposition in der Z-Dimension in Weltkoordinaten",
  "LogicType.Temperature": "Der aktuelle Temperaturwert des Geräts",
  "LogicType.TemperatureDifferentialEfficiency": "Wie sich der Unterschied zwischen der Temperatur des Eingangs- und des Abfallrohrs auf den Wirkungsgrad der Maschine auswirkt",
  "LogicType.TemperatureExternal": "Die Temperatur der Außenseite des Geräts, normalerweise die Weltatmosphäre, die es umgibt",
  "LogicType.TemperatureInput": "Der aktuelle Temperaturwert des Eingangsnetzwerks des Geräts",
  "LogicType.TemperatureInput2": "Der aktuelle Temperaturwert des Input2 Netzwerks des Geräts",
  "LogicType.TemperatureOutput": "Die aktuelle Temperaturanzeige des Netzwerks der Ausgabe des Geräts",
  "LogicType.TemperatureOutput2": "Der aktuelle Temperaturwert des Output2 Netzwerks des Geräts",
  "LogicType.TemperatureSetting": "Die aktuelle Einstellung für die Innentemperatur des Objekts (z. B. des Hardsuit A/C)",
  "LogicType.Throttle": "Erhöht die Geschwindigkeit, mit der die Maschine arbeitet (Bereich: 0-100)",
  "LogicType.Time": "Zeit",
  "LogicType.TotalMoles": "Gibt die Gesamtmolzahl des Geräts zurück",
  "LogicType.TotalMolesInput": "Gibt die Gesamtmolzahl des Eingangsnetzwerks des Geräts zurück",
  "LogicType.TotalMolesInput2": "Gibt die Gesamtmolzahl des Input2 Netzwerks des Geräts zurück",
  "LogicType.TotalMolesOutput": "Gibt die Gesamtmolzahl des Netzwerks für die Ausgabe des Geräts zurück",
  "LogicType.TotalMolesOutput2": "Gibt die Gesamtmolzahl des Output2 Netzwerks der Vorrichtung zurück",
  "LogicType.VelocityMagnitude": "Die aktuelle Größe des Geschwindigkeitsvektors",
  "LogicType.VelocityRelativeX": "Die aktuelle Geschwindigkeit X relativ zum Vorwärtsvektor des",
  "LogicType.VelocityRelativeY": "Die aktuelle Geschwindigkeit Y relativ zum Vorwärtsvektor von this",
  "LogicType.VelocityRelativeZ": "Die aktuelle Geschwindigkeit Z relativ zum Vorwärtsvektor von this",
  "LogicType.Vertical": "Vertikale Einstellung des Geräts",
  "LogicType.VerticalRatio": "Funk der vertikalen Einstellung für das Gerät",
  "LogicType.Volume": "Gibt das Atmosphärenvolumen des Geräts zurück",
  "LogicType.WattsReachingContact": "Die Menge an Watt, die tatsächlich auf den Kontakt trifft. Dies hängt von der Energie der Schüssel ab und davon, wie weit die Schüssel vom Kontaktvektor entfernt ist.",
  "LogicType.WorkingGasEfficiency": "Die von der Maschine gemeldete Arbeitsgas-Effizienz, als Float zwischen 0 und 1",
  "abs": "Register = der absolute Wert von a",
  "acos": "Gibt den Kosinus des angegebenen Winkels zurück (im Bogenmaß)",
  "alias": "Beschriftet das Register oder die Gerätereferenz mit dem Namen. Gerätereferenzen wirken sich auch darauf aus, was auf den Schrauben auf der IC-Basis angezeigt wird.",
  "asin": "Liefert den Winkel (Bogenmaß), dessen Sinus der angegebene Wert ist",
  "atan": "Liefert den Winkel (Bogenmaß), dessen tan der angegebene Wert ist",
  "atan2": "Gibt den Winkel (Bogenmaß) zurück, dessen Tangens der Quotient aus zwei angegebenen Werten ist: a (y) und b (x)",
  "bap": "Nach Zeile d verzweigen, wenn abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8)",
  "bapal": "Verzweige zu Zeile c, wenn a != b und speichere die nächste Zeilennummer in ra",
  "bapz": "Verzweige zu Zeile c, wenn abs(a) <= float.epsilon \\* 8",
  "bapzal": "Verzweige zu Zeile c, wenn abs(a) <= float.epsilon \\* 8",
  "bdns": "Verzweige zu Zeile a, wenn Gerät d nicht gesetzt ist",
  "bdnsal": "Springe zur Zeile a und speichere die nächste Zeilennummer, wenn das Gerät nicht gesetzt ist",
  "bdse": "Verzweige zu Zeile a, wenn Gerät d gesetzt ist",
  "bdseal": "Springe zur Zeile a und speichere die nächste Zeilennummer, wenn device gesetzt ist",
  "beq": "In Zeile c verzweigen, wenn a == b",
  "beqal": "Verzweige zu Zeile c, wenn a == b und speichere die nächste Zeilennummer in ra",
  "beqz": "In Zeile b verzweigen, wenn a == 0",
  "beqzal": "Verzweige zu Zeile b, wenn a == 0 und speichere die nächste Zeilennummer in ra",
  "bge": "Verzweigung in Zeile c, wenn a >= b",
  "bgeal": "Verzweige zu Zeile c, wenn a >= b und speichere die nächste Zeilennummer in ra",
  "bgez": "Verzweige zu Zeile b, wenn a >= 0",
  "bgezal": "Verzweige zu Zeile b, wenn a >= 0 ist und speichere die nächste Zeilennummer in ra",
  "bgt": "Verzweige zu Zeile c, wenn a > b",
  "bgtal": "Verzweige zu Zeile c, wenn a > b und speichere die nächste Zeilennummer in ra",
  "bgtz": "In Zeile b verzweigen, wenn a > 0",
  "bgtzal": "Verzweige zu Zeile b, wenn a > 0 und speichere die nächste Zeilennummer in ra",
  "ble": "Verzweigung in Zeile c, wenn a <= b",
  "bleal": "Verzweige zu Zeile c, wenn a <= b und speichere die nächste Zeilennummer in ra",
  "blez": "Verzweige zu Zeile b, wenn a <= 0",
  "blezal": "Verzweige zu Zeile b, wenn a <= 0 und speichere die nächste Zeilennummer in ra",
  "blt": "Verzweige zu Zeile c, wenn a < b",
  "bltal": "Verzweige zu Zeile c, wenn a < b und speichere die nächste Zeilennummer in ra",
  "bltz": "Verzweige zu Zeile b, wenn a < 0",
  "bltzal": "Verzweige zu Zeile b, wenn a < 0 und speichere die nächste Zeilennummer in ra",
  "bna": "Verzweige zu Zeile d, wenn abs(a - b) > max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8)",
  "bnaal": "Verzweige zu Zeile d, wenn abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8) und speichere die nächste Zeilennummer in ra",
  "bnaz": "Verzweige zu Zeile c, wenn abs(a) <= float.epsilon \\* 8",
  "bnazal": "Verzweige zu Zeile c, wenn abs(a) > float.epsilon \\* 8",
  "bne": "Nach Zeile c verzweigen, wenn a != b",
  "bneal": "Verzweige zu Zeile c, wenn a != b und speichere die nächste Zeilennummer in ra",
  "bnez": "Verzweigung in Zeile b, wenn a != 0",
  "bnezal": "Verzweige zu Zeile b, wenn a != 0 und speichere die nächste Zeilennummer in ra",
  "brap": "Relativer Sprung nach Zeile d, wenn abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8)",
  "brapz": "Relative Verzweigung nach Zeile c, wenn abs(a) <= float.epsilon \\* 8",
  "brdns": "Relativer Sprung in Zeile a, wenn Gerät nicht gesetzt ist",
  "brdse": "Relativer Sprung zur Zeile a, wenn Gerät gesetzt ist",
  "breq": "Relativer Sprung zu Zeile c, wenn a == b",
  "breqz": "Relativer Zweig zu Zeile b, wenn a == 0",
  "brge": "Relativer Sprung zu Zeile c, wenn a >= b",
  "brgez": "Relative Verzweigung nach Zeile b, wenn a >= 0",
  "brgt": "Relativer Sprung zu Zeile c, wenn a > b",
  "brgtz": "Relativer Abzweig nach Zeile b, wenn a > 0",
  "brle": "Relativer Sprung zu Zeile c, wenn a <= b",
  "brlez": "Relative Verzweigung nach Zeile b, wenn a <= 0",
  "brlt": "Relativer Sprung zu Zeile c, wenn a < b",
  "brltz": "Relative Verzweigung zu Zeile b, wenn a < 0",
  "brna": "Relativer Sprung nach Zeile d, wenn abs(a - b) > max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8)",
  "brnaz": "Relative Verzweigung zu Zeile c, wenn abs(a) > float.epsilon \\* 8",
  "brne": "Relativer Sprung nach Zeile c, wenn a != b",
  "brnez": "Relativer Zweig zu Zeile b, wenn a != 0",
  "ceil": "Register = kleinste ganze Zahl größer als a",
  "cos": "Gibt den Kosinus des angegebenen Winkels zurück (im Bogenmaß)",
  "define": "Erzeugt eine Beschriftung, die im gesamten Programm durch den angegebenen Wert ersetzt wird.",
  "floor": "Register = größte ganze Zahl kleiner als a",
  "hcf": "Anhalten und Feuer fangen",
  "j": "Ausführung zu Zeile a springen",
  "jal": "Springe zur Zeile a und speichere die nächste Zeilennummer in ra",
  "jr": "Relativer Sprung zur Zeile a",
  "l": "Lädt die Geräte-Var zur Registrierung.",
  "label": "VERALTET",
  "lb": "Lädt var von allen Netzwerkgeräten der Ausgabe mit dem angegebenen Hash-Typ, indem es den Stapelmodus benutzt. Durchschnitt (0), Summe (1), Minimum (2), Maximum (3). Kann entweder das Wort oder die Zahl benutzen.",
  "lr": "Lädt das Reagens des ReagensMode des Geräts in das Register. Inhalt (0), Erforderlich (1), Rezept (2). Kann entweder das Wort oder die Zahl benutzen.",
  "ls": "Lädt den Slot Var des Geräts in das Register.",
  "max": "Register = Maximum von a oder b",
  "min": "Register = Mindestwert von a oder b",
  "mod": "Register = a mod b (Hinweis: NICHT a % b)",
  "move": "Register = angegebene Zahl oder Wert des Registers.",
  "peek": "Register = der Wert, der oben auf dem Stack liegt",
  "pop": "Register = der Wert am oberen Ende des Stacks und dekrementiert sp",
  "push": "Schiebt den Wert von a auf den Stack bei sp und erhöht sp",
  "rand": "Register = ein zufälliger Wert x mit 0 <= x < 1",
  "round": "Register = a gerundet auf die nächste ganze Zahl",
  "s": "Speichert den Wert des Registers in var auf dem Gerät.",
  "sap": "Register = 1, wenn abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8), sonst 0",
  "sapz": "Register = 1, wenn |a| <= float.epsilon \\* 8, sonst 0",
  "sb": "Speichert den Wert des Registers var auf allen Netzwerkgeräten mit Ausgabe mit dem angegebenen Hash-Typ.",
  "sdns": "Register = 1, wenn das Gerät nicht eingestellt ist, sonst 0.",
  "sdse": "Register = 1, wenn das Gerät eingestellt ist, sonst 0.",
  "select": "Register = b, wenn a ungleich Null ist, sonst c",
  "seq": "Register = 1, wenn a == b, sonst 0",
  "seqz": "Register = 1, wenn a == 0, sonst 0",
  "sge": "Register = 1, wenn a >= b, sonst 0",
  "sgez": "Register = 1, wenn a >= 0, sonst 0",
  "sgt": "Register = 1, wenn a > b, sonst 0",
  "sgtz": "Register = 1, wenn a > 0, sonst 0",
  "sin": "Gibt den Sinus des angegebenen Winkels zurück (im Bogenmaß)",
  "sle": "Register = 1, wenn a <= b, sonst 0",
  "sleep": "Hält die Ausführung auf dem IC für a Sekunden an",
  "slez": "Register = 1, wenn a <= 0, sonst 0",
  "slt": "Register = 1, wenn a < b, sonst 0",
  "sltz": "Register = 1, wenn a < 0, sonst 0",
  "sna": "Register = 1, wenn abs(a - b) > max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8), sonst 0",
  "snaz": "Register = 1, wenn |a| > float.epsilon, sonst 0",
  "sne": "Register = 1, wenn a != b, sonst 0",
  "snez": "Register = 1, wenn a != 0, sonst 0",
  "sqrt": "Register = Quadratwurzel von a",
  "tan": "Gibt den Tangens des angegebenen Winkels zurück (im Bogenmaß)",
  "trunc": "Register = a ohne die Nachkommastelle",
  "yield": "Pausiert die Ausführung für 1 Tick"
}