{
    "LogicType.Activate": "1 si el dispositivo está activado (normalmente significa en funcionamiento), de lo contrario 0",
    "LogicType.AirRelease": "El estado actual del sistema de purga de aire, por ejemplo AirRelease = 1 para un traje de protección, ajusta Air Release a On",
    "LogicType.Charge": "La carga actual que tiene el dispositivo",
    "LogicType.ClearMemory": "Cuando se ajusta a 1, borra la memoria del contador (por ejemplo, ExportCount). Se volverá a poner a 0 cuando se acciona",
    "LogicType.Color": "Ya sea impulsado por preocupaciones por la claridad, la seguridad o la estética simple, Stationeers tienen acceso a un pequeño arco iris de colores para sus construcciones. Estos son los ajustes de color de los dispositivos, representados como un número entero.\n\n0: azul\n1: gris\n2: verde\n3: naranja\n4: rojo\n5: amarillo\n6: blanco\n7: negro\n8: marrón\n9: caqui\n10: rosa\n11: púrpura\n\nEs una ley universal inquebrantable que cualquier cosa superior a 11 será púrpura. El ODA es impotente para cambiar esto. Del mismo modo, cualquier valor inferior a 0 será azul.",
    "LogicType.Combustion": "La atmósfera de evaluación está en llamas. Devuelve 1 si la atmósfera está en llamas, 0 si no.",
    "LogicType.CompletionRatio": "Qué tan completa es la producción actual de este dispositivo, entre 0 y 1",
    "LogicType.ElevatorLevel": "Nivel en el que se encuentra actualmente el ascensor",
    "LogicType.ElevatorSpeed": "Velocidad actual del ascensor",
    "LogicType.Error": "1 si el dispositivo está en estado de error, de lo contrario 0",
    "LogicType.ExportCount": "Cuántos artículos se exportaron desde la última vez que ClearMemory",
    "LogicType.Filtration": "El estado actual del sistema de filtración, por ejemplo Filtración = 1 para un Traje de protección pone la filtración en On",
    "LogicType.ForceWrite": "Fuerza a los dispositivos de escritura lógica a reescribir el valor",
    "LogicType.Harvest": "Realiza la acción de cosecha para cualquier maquinaria de la planta",
    "LogicType.Horizontal": "Ajuste horizontal del dispositivo",
    "LogicType.HorizontalRatio": "Equipo de comunicaciones de ajuste horizontal para el dispositivo",
    "LogicType.Idle": "Devuelve 1 si el dispositivo está actualmente inactivo, de lo contrario 0",
    "LogicType.ImportCount": "Cuántos artículos se han importado desde la última vez que ClearMemory",
    "LogicType.Lock": "1 si el dispositivo está bloqueado, de lo contrario 0, puede ajustarse en la mayoría de los dispositivos e impide que el usuario acceda a los valores",
    "LogicType.ManualResearchRequiredPod": "Establece el tipo de cápsula para buscar una determinada cápsula cuando se rompe una cápsula.",
    "LogicType.Maximum": "Ajuste máximo del dispositivo",
    "LogicType.MineablesInQueue": "Devuelve la cantidad de objetos extraíbles que AIMEe ha puesto en cola para extraer.",
    "LogicType.MineablesInVicinity": "Devuelve la cantidad de posibles minas dentro de un área extendida alrededor de AIMEe.",
    "LogicType.Mode": "Números enteros para el estado de modo, diferentes dispositivos tendrán diferentes estados de modo disponibles para ellos",
    "LogicType.NextWeatherEventTime": "Vuelve en lo antes posible cuando llegue el próximo evento meteorológico.",
    "LogicType.On": "El estado actual del dispositivo, 0 para apagado, 1 para encendido",
    "LogicType.Open": "1 si el dispositivo está abierto, en caso contrario 0",
    "LogicType.Output": "La operación de salida para un dispositivo de manipulación de clasificaciones, como un apilador o un clasificador, cuando en el modo lógico el dispositivo sólo actuará una repetición cuando se ponga a cero o superior y luego volverá a -1 y esperará instrucciones adicionales",
    "LogicType.Plant": "Realiza la acción de siembra de cualquier maquinaria de la fábrica",
    "LogicType.PositionX": "La posición actual en la dimensión X en coordenadas mundiales",
    "LogicType.PositionY": "La posición actual en la dimensión Y en coordenadas mundiales",
    "LogicType.PositionZ": "La posición actual en la dimensión Z en coordenadas mundiales",
    "LogicType.Power": "Puede leerse para indicar si el dispositivo está correctamente alimentado o no, configurado a través del sistema de alimentación, retornar 1 si está alimentado y 0 si no lo está",
    "LogicType.PowerActual": "Cuánta energía está utilizando realmente el dispositivo o la red",
    "LogicType.PowerGeneration": "Devuelve cuánta energía se está generando",
    "LogicType.PowerPotential": "Cuánta energía puede suministrar el dispositivo o la red",
    "LogicType.PowerRequired": "Potencia solicitada desde el dispositivo y/o red",
    "LogicType.PrefabHash": "El hash de la estructura",
    "LogicType.Pressure": "La lectura actual de la presión del dispositivo",
    "LogicType.PressureExternal": "Ajuste para la seguridad de la presión externa, en KPa",
    "LogicType.PressureInternal": "Ajuste para la seguridad de la presión interna, en KPa",
    "LogicType.PressureSetting": "El ajuste actual para la presión interna del objeto (p. ej., la liberación de aire de traje de protección), en KPa",
    "LogicType.Quantity": "Cantidad total en el dispositivo",
    "LogicType.Ratio": "Valor específico del contexto en función del dispositivo, relación de 0 a 1",
    "LogicType.RatioCarbonDioxide": "La relación de co2 en la atmósfera del dispositivo",
    "LogicType.RatioCarbonDioxideInput": "The ratio of Dióxido de carbono in device's input network",
    "LogicType.RatioCarbonDioxideInput2": "The ratio of Dióxido de carbono in device's Input2 network",
    "LogicType.RatioCarbonDioxideOutput": "The ratio of Dióxido de carbono in device's Output network",
    "LogicType.RatioCarbonDioxideOutput2": "The ratio of Dióxido de carbono in device's Output2 network",
    "LogicType.RatioNitrogen": "La relación de contaminantes en la atmósfera del dispositivo",
    "LogicType.RatioNitrousOxide": "La proporción de óxido nitroso en la atmósfera del dispositivo",
    "LogicType.RatioNitrousOxideInput": "The ratio of Óxido Nitroso in device's input network",
    "LogicType.RatioNitrousOxideInput2": "The ratio of Óxido Nitroso in device's Input2 network",
    "LogicType.RatioNitrousOxideOutput": "The ratio of Óxido Nitroso in device's Output network",
    "LogicType.RatioNitrousOxideOutput2": "The ratio of Óxido Nitroso in device's Output2 network",
    "LogicType.RatioOxygen": "La proporción de oxígeno en la atmósfera del dispositivo",
    "LogicType.RatioPollutant": "La relación de contaminantes en la atmósfera del dispositivo",
    "LogicType.RatioVolatiles": "La proporción de volátiles en la atmósfera del dispositivo",
    "LogicType.RatioWater": "La proporción de agua en la atmósfera del dispositivo",
    "LogicType.Reagents": "Número total de reactivos registrados por el dispositivo",
    "LogicType.RecipeHash": "Hash actual de la receta que el dispositivo está configurado para producir",
    "LogicType.RequestHash": "Cuando se establece en el identificador único, vuelve a buscar un elemento del tipo proporcionado desde el dispositivo",
    "LogicType.RequiredPower": "Cantidad de potencia en reposo, no necesariamente incluye potencia de demanda adicional",
    "LogicType.Setting": "Un ajuste variable que se puede leer o escribir, dependiendo del dispositivo",
    "LogicType.SignalID": "Devuelve el ID de contacto de la señal más fuerte de este satélite",
    "LogicType.SignalStrength": "Devuelve la fuerza de la señal más fuerte recibida de este satélite",
    "LogicType.SolarAngle": "Ángulo solar del dispositivo",
    "LogicType.TargetX": "La posición actual en la dimensión X en coordenadas mundiales",
    "LogicType.TargetY": "La posición actual en la dimensión Y en coordenadas mundiales",
    "LogicType.TargetZ": "La posición actual en la dimensión Z en coordenadas mundiales",
    "LogicType.Temperature": "La lectura de la temperatura actual del dispositivo",
    "LogicType.TemperatureExternal": "La temperatura del exterior del dispositivo, normalmente la atmósfera del mundo que lo rodea",
    "LogicType.TemperatureSetting": "El ajuste actual de la temperatura interna del objeto (por ejemplo, el Traje de protección A/C)",
    "LogicType.TotalMoles": "Devuelve el total de los moles del dispositivo",
    "LogicType.VelocityMagnitude": "La magnitud actual del vector de velocidad",
    "LogicType.VelocityRelativeX": "La velocidad actual X en relación con el vector delantero de éste",
    "LogicType.VelocityRelativeY": "La velocidad actual Y en relación con el vector delantero de éste",
    "LogicType.VelocityRelativeZ": "La velocidad actual Z es relativa al vector delantero de esta",
    "LogicType.Vertical": "Ajuste vertical del dispositivo",
    "LogicType.VerticalRatio": "Equipo de comunicaciones de ajuste vertical para el dispositivo",
    "LogicType.Volume": "Devuelve el volumen de la atmósfera del dispositivo",
    "abs": "Registro = el valor absoluto de un",
    "acos": "Devuelve el coseno del ángulo especificado",
    "alias": "Etiquetas de registro o referencia de dispositivo con nombre, las referencias de dispositivo también afectan a lo que se muestra en los tornillos de la base del IC.",
    "asin": "Devuelve el ángulo cuyo seno es el valor especificado",
    "atan": "Devuelve el ángulo cuyo tangente es el valor especificado",
    "bap": "Se bifurca a la línea d si abs (a - b) <= max (c \\* max (abs (a), abs (b)), float.epsilon \\* 8)",
    "bapal": "Bifurca a la línea c si a != b y guarda el siguiente número de línea en ra",
    "bapz": "Rama de la línea c si abs(a) <= float.epsilon \\* 8",
    "bapzal": "Rama de la línea c si abs(a) <= float.epsilon \\* 8",
    "bdns": "Bifurcación a la línea a si el dispositivo d no está configurado",
    "bdnsal": "Saltar la ejecución a la línea a y almacenar el siguiente número de línea si el dispositivo no está configurado",
    "bdse": "Bifurcarse a la línea a si el dispositivo d está configurado",
    "bdseal": "Saltar la ejecución a la línea a y almacenar el siguiente número de línea si el dispositivo está configurado",
    "beq": "Rama de a la línea c si a == b",
    "beqal": "Bifurca a la línea c si a == b y guarda el siguiente número de línea en ra",
    "beqz": "Rama de la línea b si a == 0",
    "beqzal": "Bifurca a la línea b si a == 0 y guarda el siguiente número de línea en ra",
    "bge": "Rama de a la línea c si a >= b",
    "bgeal": "Bifurca a la línea c si a >= b y guarda el siguiente número de línea en ra",
    "bgez": "Rama de la línea b si a >= 0",
    "bgezal": "Bifurca a la línea b si a >= 0 y almacena el siguiente número de línea en ra",
    "bgt": "Rama de la línea c si a > b",
    "bgtal": "Bifurcarse a la línea c si a > b y almacenar el siguiente número de línea en ra",
    "bgtz": "Rama de la línea b si a > 0",
    "bgtzal": "Bifurcarse a la línea b si a > 0 y almacenar el siguiente número de línea en ra",
    "ble": "Rama de a la línea c si a <= b",
    "bleal": "Bifurca a la línea c si a <= b y guarda el siguiente número de línea en ra",
    "blez": "Rama de la línea b si a <= 0",
    "blezal": "Bifurca a la línea b si a <= 0 y guarda el siguiente número de línea en ra",
    "blt": "Rama de la línea c si a < b",
    "bltal": "Bifurcarse a la línea c si a < b y almacenar el siguiente número de línea en ra",
    "bltz": "Rama de la línea b si a < 0",
    "bltzal": "Bifurcarse a la línea b si a < 0 y almacenar el siguiente número de línea en ra",
    "bna": "Se bifurca a la línea d si abs (a - b)> max (c \\* max (abs (a), abs (b)), float.epsilon \\* 8)",
    "bnaal": "Rama de la línea d si abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8) y guardar el siguiente número de línea en ra",
    "bnaz": "Rama de la línea c si abs(a) > float.epsilon \\* 8",
    "bnazal": "Rama de la línea c si abs(a) > float.epsilon \\* 8",
    "bne": "Rama de a la línea c si a != b",
    "bneal": "Bifurca a la línea c si a != b y guarda el siguiente número de línea en ra",
    "bnez": "rama de la línea b si a != 0",
    "bnezal": "Bifurca a la línea b si a != 0 y guarda el siguiente número de línea en ra",
    "brap": "Rama relativa a la línea d si abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8)",
    "brapz": "Rama relativa a la línea c si abs(a) <= float.epsilon \\* 8",
    "brdns": "Salto relativo a la línea a si el dispositivo no está configurado",
    "brdse": "Salto relativo a la línea a si el dispositivo está configurado",
    "breq": "Rama relativa a la línea c si a == b",
    "breqz": "Rama relativa a la línea b si a == 0",
    "brge": "Salto relativo a la línea c si a >= b",
    "brgez": "Rama relativa a la línea b si a >= 0",
    "brgt": "salto relativo a la línea c si a > b",
    "brgtz": "Rama relativa a la línea b si a > 0",
    "brle": "Salto relativo a la línea c si a <= b",
    "brlez": "Rama relativa a la línea b si a <= 0",
    "brlt": "Salto relativo a la línea c si a < b",
    "brltz": "Rama relativa a la línea b si a < 0",
    "brna": "Rama relativa a la línea d si abs(a - b) > max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8)",
    "brnaz": "Rama relativa a la línea c si abs(a) > float.epsilon \\* 8",
    "brne": "Rama relativa a la línea c si a != b",
    "brnez": "Rama relativa a la línea b si a != 0",
    "ceil": "Registro = el menor número entero mayor que un",
    "cos": "Devuelve el coseno del ángulo especificado",
    "define": "Crea una etiqueta que será reemplazada a lo largo del programa con el valor proporcionado.",
    "exp": "Registro = exp(a)",
    "floor": "Registro = el mayor número entero menor que un",
    "hcf": "Detenerse y prenderse fuego",
    "j": "Saltar la ejecución a la línea a",
    "jal": "Saltar la ejecución a la línea a y almacenar el siguiente número de línea en ra",
    "jr": "Salto relativo a la línea a",
    "l": "Carga el dispositivo variable para registrar.",
    "lb": "Las cargas varían de todos los dispositivos de red de salida con el tipo de hash proporcionado usando el modo de lote proporcionado. Promedio (0), Suma (1), Mínimo (2), Máximo (3). Puede usar la palabra o el número.",
    "log": "Registro = log(a)",
    "lr": "Carga el reactivo del reagentMode del dispositivo para registrarlo. Contenido (0), Requerido (1), Receta (2). Puede usar la palabra o el número.",
    "ls": "Carga la variable de la ranura en el dispositivo para registrar.",
    "max": "Registro = máximo de a o b",
    "min": "Registro = min de a o b",
    "mod": "Registro = a mod b (nota: NO a % b)",
    "move": "Registro = número proporcionado o valor de registro.",
    "peek": "Registro = el valor en la parte superior de la pila",
    "pop": "Registro = el valor en la parte superior de la pila y disminuye sp",
    "push": "Empuja el valor de a a la pila a sp e incrementa sp",
    "rand": "Registro = un valor aleatorio x con 0 <= x < 1",
    "round": "Registro = un redondeo al entero más cercano",
    "s": "Almacena el valor de registro para variar en el dispositivo.",
    "sap": "Registro = 1 si abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8), de lo contrario 0",
    "sapz": "Registro = 1 si |a| <= float.epsilon \\* 8, de lo contrario 0",
    "sb": "Almacena el valor de registro para variar en todos los dispositivos de red de salida con el tipo de registro proporcionado.",
    "sdns": "Registro = 1 si el dispositivo no está configurado, de lo contrario 0",
    "sdse": "Registro = 1 si el dispositivo está configurado, de lo contrario 0.",
    "select": "Registro = b si a no es cero, de lo contrario c",
    "seq": "Registro = 1 si a == b, de lo contrario 0",
    "seqz": "Registro = 1 si a == 0, de lo contrario 0",
    "sge": "Registro = 1 si a >= b, de lo contrario 0",
    "sgez": "Registro = 1 si un >= 0, de lo contrario 0",
    "sgt": "Registro = 1 si a > b, de lo contrario 0",
    "sgtz": "Registro = 1 si es > 0, de lo contrario 0",
    "sin": "Devuelve el seno del ángulo especificado",
    "sle": "Registro = 1 si a <= b, de lo contrario 0",
    "sleep": "Hace una pausa en la ejecución en el IC por un segundo",
    "slez": "Registro = 1 si un <= 0, de lo contrario 0",
    "slt": "Registro = 1 si a < b, de lo contrario 0",
    "sltz": "Registro = 1 si es < 0, de lo contrario 0",
    "sna": "Registro = 1 si abs(a - b) > max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8), en caso contrario 0",
    "snaz": "Registro = 1 si |a| > float.epsilon, de lo contrario 0",
    "sne": "Registro = 1 si a != b, de lo contrario 0",
    "snez": "Registro = 1 si un != 0, de lo contrario 0",
    "sqrt": "Registro = raíz cuadrada de un",
    "tan": "Devuelve la tangente del ángulo especificado",
    "trunc": "Registro = a con la parte fraccionaria eliminada",
    "yield": "Pone en pausa la ejecución por 1 tick"
}
