{
  "LogicType.Acceleration": "Changement de vitesse. Les fusées qui décélèrent lors de l'atterrissage afficheront une valeur négative.",
  "LogicType.Activate": "1 si l'appareil est activé (généralement signifie en cours d'exécution), sinon 0",
  "LogicType.AirRelease": "L'état actuel du système d'évacuation d'air, par exemple : AirRelease = 1 pour une combinaison spatiale, active l'évacuation de l'air",
  "LogicType.AlignmentError": "L'écart angulaire entre l'orientation actuelle du télescope et la cible. Indique l’écart du télescope par rapport à la cible. Renvoie NaN lorsqu'il n'y a pas de cible.",
  "LogicType.Altitude": "L'altitude de la fusée au-dessus de la surface de la planète. -1 si la fusée est dans l'espace.",
  "LogicType.Apex": "L'altitude la plus basse que la fusée atteindra avant de recommencer à monter.",
  "LogicType.AutoLand": "Active l'algorithme d'atterrissage automatique. La fusée ajustera automatiquement la poussée et activera et désactivera ses moteurs pour réaliser un atterrissage en douceur.",
  "LogicType.AutoShutOff": "Désactive tous les appareils dans la fusée dès qu'elle atteint sa destination.",
  "LogicType.BestContactFilter": "Filtre la sélection automatique des cibles du satellite à un seul ID de référence.",
  "LogicType.Bpm": "BPM (battements par minute)",
  "LogicType.BurnTimeRemaining": "Temps estimé en secondes avant que le carburant ne soit épuisé. Calculé en fonction de la consommation actuelle du carburant.",
  "LogicType.CelestialHash": "Le Hash actuel du corps céleste ciblé \n(c'est un identifiant numérique unique pour tous les objets identiques).",
  "LogicType.CelestialParentHash": "Le Hash du nom du corps céleste parent autour duquel l'objet orbite, 0 s'il n'y a pas de corps céleste parent.",
  "LogicType.Channel0": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Channel1": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Channel2": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Channel3": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Channel4": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Channel5": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Channel6": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Channel7": "Canal sur un réseau câblé à considérer comme volatile",
  "LogicType.Charge": "La charge actuelle que l'appareil a",
  "LogicType.Chart": "État d'avancement du scan de cartographie à l'emplacement ciblé sur la carte spatiale de la fusée. Retourne une valeur normalisée. Si le scan de cartographie n'est pas disponible, retourne -1.",
  "LogicType.ChartedNavPoints": "Le nombre de points de navigation cartographiés à l'emplacement ciblé sur la carte spatiale de la fusée.",
  "LogicType.ClearMemory": "Lorsqu'il est configuré sur 1, efface la mémoire du compteur (par exemple ExportCount). Va se remettre à 0 lorsqu'il est actionnée",
  "LogicType.CollectableGoods": "Obtient le coût du carburant pour ramener la fusée dans votre monde actuel.",
  "LogicType.Color": "Que ce soit par souci de clarté, de sécurité ou de simple esthétique, les Stationeers ont accès à un petit panel de couleurs pour leurs constructions. Ci-dessous, les paramètres de couleur, représentés par un nombre entier.\n\n 0 : Bleu\n 1 : Gris\n 2 : Vert\n 3 : Orange\n 4 : Rouge\n 5 : Jaune\n 6 : Blanc\n 7 : Noir\n 8 : Marron\n 9 : Kaki\n10 : Rose\n11 : Violet\n\nC’est une loi universelle inébranlable que tout ce qui dépasse 11 sera violet. L'ODA est impuissante à changer cela. De même, tout ce qui est inférieur à 0 sera bleu.",
  "LogicType.Combustion": "L’atmosphère d’évaluation est en feu. Retours 1 si l’atmosphère est en feu, 0 sinon.",
  "LogicType.CombustionInput": "L'atmosphère est en feu. Renvoie 1 si le réseau d'entrée de l'appareil est en feu, 0 sinon.",
  "LogicType.CombustionInput2": "L'atmosphère est en feu. Renvoie 1 si le réseau d'entrée 2 de l'appareil est en feu, 0 sinon.",
  "LogicType.CombustionLimiter": "Ralentit le taux de combustion à l'intérieur de la machine (plage : 0-100), 0 étant le taux de combustion le plus lent et 100 le plus rapide",
  "LogicType.CombustionOutput": "L'atmosphère est en feu. Renvoie 1 si le réseau de sortie de l'appareil est en feu, 0 sinon.",
  "LogicType.CombustionOutput2": "L'atmosphère est en feu. Renvoie 1 si le réseau de sortie 2 de l'appareil est en feu, 0 sinon.",
  "LogicType.CompletionRatio": "Comment compléter la production actuelle pour cet appareil, entre 0 et 1",
  "LogicType.ContactTypeId": "L'identifiant de type de contact",
  "LogicType.CurrentCode": "L'adresse sur la carte spatiale de la cible actuel de la fusée.",
  "LogicType.Density": "La densité du gisement exploitable du site ciblé de la fusée.",
  "LogicType.DestinationCode": "L'adresse sur la carte spatiale du site ciblé de la fusée.",
  "LogicType.Discover": "État d'avancement du scan de découverte à l'emplacement ciblé sur la carte spatiale de la fusée. Retourne une valeur normalisée. Si le scan de découverte n'est pas disponible, retourne -1.",
  "LogicType.DistanceAu": "La distance actuelle du corps céleste, mesurée en unités astronomiques.",
  "LogicType.DistanceKm": "La distance actuelle du corps céleste, mesurée en kilomètres.",
  "LogicType.DrillCondition": "L'état actuel de la tête de foreuse dans l'emplacement de foreuse de cet appareil.\nExprimé sous forme de ratio entre 0 et 1.",
  "LogicType.DryMass": "La masse de la fusée en kilogrammes, sans le carburant. Plus la fusée est massive, plus il faudra de carburant pour se déplacer vers une nouvelle destination dans l'espace.",
  "LogicType.Eccentricity": "Mesure à quel point une orbite est elliptique (ovale). Varie de 0 (un cercle parfait) à 1 (une trajectoire parabolique).",
  "LogicType.ElevatorLevel": "Niveau auquel se trouve actuellement l'ascenseur",
  "LogicType.ElevatorSpeed": "Vitesse actuelle de l'ascenseur",
  "LogicType.EntityState": "L'état actuel de l'entité, tel que morte, inconsciente ou vivante, exprimé en entier d'état.",
  "LogicType.EnvironmentEfficiency": "L'efficacité environnementale rapportée par la machine, sous forme d'un nombre flottant entre 0 et 1",
  "LogicType.Error": "1 si l'appareil est en état d'erreur, sinon 0",
  "LogicType.ExhaustVelocity": "La vitesse des gaz d'échappement en m/s",
  "LogicType.ExportCount": "Nombre d'articles exportés depuis la dernière ClearMemory",
  "LogicType.Extended": "Étendu",
  "LogicType.Filtration": "L'état actuel du système de filtration, par exemple : Filtration = 1 pour une combinaison spatiale, active la filtration",
  "LogicType.FlightControlRule": "Règle de contrôle de vol de la fusée.\n\nMode 0 : Aucun : Pas de pilote automatique. \nMode 1 : Normal : Cible de descente à 60m. \nMode 2 : Alternatif : Vitesse élevée - Plein régime. \nMode 3 : Alternatif2 : Cible une vitesse de descente appropriée car la vitesse est trop faible. \nMode 4 : Approche finale : Descente vers la platforme de lancement de manière contrôlée.",
  "LogicType.Flush": "Définir sur 1 pour activer la fonction de vidange sur l'appareil",
  "LogicType.ForceWrite": "Force les logiques d'écriture à réécrire la valeur",
  "LogicType.ForwardX": "La direction vers laquelle l'entité est orientée, exprimée sous forme de vecteur normalisé.",
  "LogicType.ForwardY": "La direction vers laquelle l'entité est orientée, exprimée sous forme de vecteur normalisé.",
  "LogicType.ForwardZ": "La direction vers laquelle l'entité est orientée, exprimée sous forme de vecteur normalisé.",
  "LogicType.Fuel": "Obtient le coût du carburant pour ramener la fusée dans votre monde actuel.",
  "LogicType.Harvest": "Effectue l'action de récolte pour toute machine à base de plantes",
  "LogicType.Horizontal": "Réglage horizontal de l'appareil",
  "LogicType.HorizontalRatio": "Ratio de réglage horizontal pour l'appareil",
  "LogicType.Idle": "Renvoie 1 si l'appareil est actuellement inactif, sinon 0",
  "LogicType.ImportCount": "Nombre d'articles importés depuis la dernière ClearMemory",
  "LogicType.Inclination": "L'inclinaison du plan orbital par rapport au plan équatorial, mesurée en degrés. Définit l'angle du plan orbital.",
  "LogicType.Index": "L'indice actuel pour l'appareil.",
  "LogicType.InterrogationProgress": "Progression de l'interrogation de la cible actuelle par cette antenne satellite, exprimée sous forme de ratio de 0 à 1",
  "LogicType.LineNumber": "Le numéro de ligne d'exécution actuel pour un circuit intégré en cours d'exécution sur cet appareil. Utilisez ce numéro avec précaution",
  "LogicType.Lock": "1 si l'appareil est verrouillé, sinon 0, peut être configuré dans la plupart des appareils et empêche l'utilisateur d'accéder aux valeurs",
  "LogicType.ManualResearchRequiredPod": "Définit le type de pod pour rechercher un pod certian lors de la décomposition d'un pod.",
  "LogicType.Mass": "La masse totale de la fusée en kilogrammes, incluant le carburant et la cargaison. Plus la fusée est massive, plus il faudra de carburant pour se déplacer vers une nouvelle destination dans l'espace.",
  "LogicType.Maximum": "Réglage maximal de l'appareil",
  "LogicType.MineablesInQueue": "Renvoie la quantité de minerais que AIMEe a prévu de miner.",
  "LogicType.MineablesInVicinity": "Renvoie la quantité de minerais potentiels dans la zone autour d’AIMEe.",
  "LogicType.MinedQuantity": "Le nombre total de ressources extraites sur le site ciblé de la carte spatiale de la fusée.",
  "LogicType.MinimumWattsToContact": "Quantité minimale requise de watts provenant de l'antenne en contact avec le commerçant cible pour initier l'interrogation du contact",
  "LogicType.Mode": "Nombres entiers pour l’état de mode, différents appareils auront différents états de mode à leur disposition",
  "LogicType.NameHash": "Fournit le Hash pour le nom du préfabriqué sous forme d'un entier 32 bits\n(c'est un identifiant numérique unique pour tous les objets identiques).",
  "LogicType.NavPoints": "Le nombre de points de navigation à l'emplacement ciblé sur la carte spatiale de la fusée.",
  "LogicType.NextWeatherEventTime": "Renvoie la durée en secondes du prochain événement météorologique.",
  "LogicType.On": "L'état actuel de l'appareil, 0 pour ÉTEINT, 1 pour ALLUMÉ",
  "LogicType.Open": "1 si l'appareil est ouvert, sinon 0",
  "LogicType.OperationalTemperatureEfficiency": "Comment la température du tuyau d'entrée affecte l'efficacité de la machine",
  "LogicType.OrbitPeriod": "Le temps nécessaire à un objet pour effectuer une orbite complète autour d'un autre objet, mesuré en jours. Indique la durée du cycle orbital.",
  "LogicType.Orientation": "L'orientation de l'entité en degrés dans un plan relatif à l'origine nord.",
  "LogicType.Output": "L'opération de sortie pour un appareil de gestion de tri, tel qu'un empileur ou un trieur, en mode logique, l'appareil n'actionne qu'une seule répétition lorsqu'il est configuré à zéro ou au-dessus, puis de nouveau à -1 et attend d'autres instructions",
  "LogicType.PassedMoles": "Le nombre de moles qui ont traversé cet appareil lors du précédent pas de simulation",
  "LogicType.Plant": "Effectue l'action de plantation pour toute machine à base de plantes",
  "LogicType.PositionX": "La position actuelle dans l'axe X en coordonnées du monde",
  "LogicType.PositionY": "La position actuelle dans l'axe Y en coordonnées du monde",
  "LogicType.PositionZ": "La position actuelle dans l'axe Z en coordonnées du monde",
  "LogicType.Power": "Peut être lu pour indiquer si l'appareil est correctement alimenté ou non, configuré via le système d'alimentation, indique 1 si alimenté et 0 si non",
  "LogicType.PowerActual": "Quelle quantité d'énergie l'appareil ou le réseau utilise-t-il réellement",
  "LogicType.PowerGeneration": "Renvoie la quantité d'énergie qui est générée",
  "LogicType.PowerPotential": "Quelle quantité d'énergie l'appareil ou le réseau peut-il fournir",
  "LogicType.PowerRequired": "Puissance demandée à partir de l'appareil et/ou du réseau",
  "LogicType.PrefabHash": "Le Hash du préfabriqué \n(c'est un identifiant numérique unique pour tous les objets identiques)",
  "LogicType.Pressure": "La pression actuelle lu sur l'appareil",
  "LogicType.PressureEfficiency": "Comment la pression du tuyau d'entrée et du tuyau de déchets affecte l'efficacité de la machine",
  "LogicType.PressureExternal": "Réglage pour la sécurité de la pression externe, en kPa. Représente la pression cible de l'atmosphère externe.",
  "LogicType.PressureInput": "La lecture actuelle de la pression du réseau d'entrée de l'appareil",
  "LogicType.PressureInput2": "La lecture actuelle de la pression du réseau d'entrée 2 de l'appareil",
  "LogicType.PressureInternal": "Réglage pour la sécurité de la pression interne, en kPa. Représente la pression cible de l'atmosphère à l'intérieur du réseau de tuyaux connecté.",
  "LogicType.PressureOutput": "La lecture actuelle de la pression du réseau de sortie de l'appareil",
  "LogicType.PressureOutput2": "Lecture actuelle de la pression du réseau de sortie 2 de l'appareil",
  "LogicType.PressureSetting": "Le réglage actuel de la pression interne de l'objet (par exemple, le dégagement d'air de la combinaison), en kPa",
  "LogicType.Progress": "Progression de la fusée vers le prochain noeud sur la carte, exprimée par une valeur entre 0 et 1.",
  "LogicType.Quantity": "Quantité totale sur l'appareil",
  "LogicType.Ratio": "Valeur spécifique au contexte en fonction de l'appareil, ratio basé de 0 à 1",
  "LogicType.RatioCarbonDioxide": "Le ratio de Dioxyde de carbone gazeux dans l'atmosphère de l'appareil",
  "LogicType.RatioCarbonDioxideInput": "Le ratio de Dioxyde de carbone gazeux dans le réseau d'entrée de l'appareil",
  "LogicType.RatioCarbonDioxideInput2": "Le ratio de Dioxyde de carbone gazeux dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioCarbonDioxideOutput": "Le ratio de Dioxyde de carbone gazeux dans le réseau de sortie de l'appareil",
  "LogicType.RatioCarbonDioxideOutput2": "Le ratio de Dioxyde de carbone gazeux dans le réseau de sortie 2 de l'appareil",
  "LogicType.RatioHydrogen": "Le ratio d'Hydrogène gazeux dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidCarbonDioxide": "Le ratio de Dioxyde de carbone liquide dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidCarbonDioxideInput": "Le ratio de Dioxyde de carbone liquide dans l'atmosphère d'entrée de l'appareil",
  "LogicType.RatioLiquidCarbonDioxideInput2": "Le ratio de Dioxyde de carbone liquide dans l'atmosphère d'entrée 2 de l'appareil",
  "LogicType.RatioLiquidCarbonDioxideOutput": "Le ratio de Dioxyde de carbone liquide dans l'atmosphère de sortie de l'appareil",
  "LogicType.RatioLiquidCarbonDioxideOutput2": "Le ratio de Dioxyde de carbone liquide dans l'atmosphère de sortie 2 de l'appareil",
  "LogicType.RatioLiquidHydrogen": "Le ratio d'Hydrogène liquide dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidNitrogen": "Le ratio d'Azote liquide dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidNitrogenInput": "Le ratio d'Azote liquide dans le réseau d'entrée de l'appareil",
  "LogicType.RatioLiquidNitrogenInput2": "Le ratio de Azote liquide dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioLiquidNitrogenOutput": "Le ratio d'Azote liquide dans le réseau de sortie de l'appareil",
  "LogicType.RatioLiquidNitrogenOutput2": "Le ratio d'Azote liquide dans le réseau de sortie 2 de l'appareil",
  "LogicType.RatioLiquidNitrousOxide": "Le ratio de Protoxyde d'azote liquide dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidNitrousOxideInput": "Le ratio de Protoxyde d'azote liquide dans l'atmosphère d'entrée de l'appareil",
  "LogicType.RatioLiquidNitrousOxideInput2": "Le ratio de Protoxyde d'azote liquide dans l'atmosphère d'entrée 2 de l'appareil",
  "LogicType.RatioLiquidNitrousOxideOutput": "Le ratio de Protoxyde d'azote liquide dans l'atmosphère de sortie de l'appareil",
  "LogicType.RatioLiquidNitrousOxideOutput2": "Le ratio de Protoxyde d'azote liquide dans l'atmosphère de sortie 2 de l'appareil",
  "LogicType.RatioLiquidOxygen": "Le ratio d'Oxygène liquide dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidOxygenInput": "Le ratio d'Oxygène liquide dans l'atmosphère d'entrée de l'appareil",
  "LogicType.RatioLiquidOxygenInput2": "Le ratio d'Oxygène liquide dans l'atmosphère d'entrée 2 de l'appareil",
  "LogicType.RatioLiquidOxygenOutput": "Le ratio d'Oxygène liquide dans l'atmosphère de sortie de l'appareil",
  "LogicType.RatioLiquidOxygenOutput2": "Le ratio d'Oxygène liquide dans l'atmosphère de sortie 2 de l'appareil",
  "LogicType.RatioLiquidPollutant": "Le ratio de Polluants liquides dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidPollutantInput": "Le ratio de Polluants liquides dans l'atmosphère d'entrée de l'appareil",
  "LogicType.RatioLiquidPollutantInput2": "Le ratio de Polluants liquides dans l'atmosphère d'entrée 2 de l'appareil",
  "LogicType.RatioLiquidPollutantOutput": "Le ratio de Polluants liquides dans l'atmosphère de sortie de l'appareil",
  "LogicType.RatioLiquidPollutantOutput2": "Le ratio de Polluants liquides dans l'atmosphère de sortie 2 de l'appareil",
  "LogicType.RatioLiquidVolatiles": "Le ratio de Volatiles liquides dans l'atmosphère de l'appareil",
  "LogicType.RatioLiquidVolatilesInput": "Le ratio de Volatiles liquides dans l'atmosphère d'entrée de l'appareil",
  "LogicType.RatioLiquidVolatilesInput2": "Le ratio de Volatiles liquides dans l'atmosphère d'entrée 2 de l'appareil",
  "LogicType.RatioLiquidVolatilesOutput": "Le ratio de Volatiles liquides dans l'atmosphère de sortie de l'appareil",
  "LogicType.RatioLiquidVolatilesOutput2": "Le ratio de Volatiles liquides dans l'atmosphère de sortie 2 de l'appareil",
  "LogicType.RatioNitrogen": "Le ratio d'Azote gazeux dans l'atmosphère de l'appareil",
  "LogicType.RatioNitrogenInput": "Le ratio d'Azote gazeux dans le réseau d'entrée de l'appareil",
  "LogicType.RatioNitrogenInput2": "Le ratio d'Azote gazeux dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioNitrogenOutput": "Le ratio d'Azote gazeux dans le réseau de sortie de l'appareil",
  "LogicType.RatioNitrogenOutput2": "Le ratio d'Azote gazeux dans le réseau de sortie 2 de l'appareil",
  "LogicType.RatioNitrousOxide": "Le ratio de Protoxyde d'azote gazeux dans l'atmosphère de l'appareil",
  "LogicType.RatioNitrousOxideInput": "Le ratio d'Protoxyde d'azote gazeux dans le réseau d'entrée de l'appareil",
  "LogicType.RatioNitrousOxideInput2": "Le ratio de Protoxyde d'azote gazeux dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioNitrousOxideOutput": "Le ratio de Protoxyde d'azote gazeux dans le réseau de sortie de l'appareil",
  "LogicType.RatioNitrousOxideOutput2": "Le ratio de Protoxyde d'azote gazeux dans le réseau de sortie 2 de l'appareil",
  "LogicType.RatioOxygen": "Le ratio d'Oxygène gazeux dans l'atmosphère de l'appareil",
  "LogicType.RatioOxygenInput": "Le ratio d'Oxygène gazeux dans le réseau d'entrée de l'appareil",
  "LogicType.RatioOxygenInput2": "Le ratio d'Oxygène gazeux dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioOxygenOutput": "Le ratio d'Oxygène gazeux dans le réseau de sortie de l'appareil",
  "LogicType.RatioOxygenOutput2": "Le ratio d'Oxygène gazeux dans le réseau de sortie 2 de l'appareil",
  "LogicType.RatioPollutant": "Le ratio de Polluants gazeux dans l’atmosphère de l'appareil",
  "LogicType.RatioPollutantInput": "Le ratio de Polluants gazeux dans le réseau d'entrée de l'appareil",
  "LogicType.RatioPollutantInput2": "Le ratio de Polluants gazeux dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioPollutantOutput": "Le ratio de Polluants gazeux dans le réseau de sortie de l'appareil",
  "LogicType.RatioPollutantOutput2": "Le ratio de Polluants gazeux dans le réseau de sortie 2 de l'appareil",
  "LogicType.RatioPollutedWater": "Le ratio d'Eau polluée liquide dans l'atmosphère de l'appareil",
  "LogicType.RatioSteam": "Le ratio de Vapeur d'eau gazeuse dans l'atmosphère de l'appareil",
  "LogicType.RatioSteamInput": "Le ratio de Vapeur d'eau gazeuse dans l'atmosphère d'entrée de l'appareil",
  "LogicType.RatioSteamInput2": "Le ratio de Vapeur d'eau gazeuse dans l'atmosphère d'entrée 2 de l'appareil",
  "LogicType.RatioSteamOutput": "Le ratio de Vapeur d'eau gazeuse dans l'atmosphère de sortie de l'appareil",
  "LogicType.RatioSteamOutput2": "Le ratio de Vapeur d'eau gazeuse dans l'atmosphère de sortie 2 de l'appareil",
  "LogicType.RatioVolatiles": "Le ratio de Volatiles gazeux dans l’atmosphère de l'appareil",
  "LogicType.RatioVolatilesInput": "Le ratio de Volatiles gazeux dans le réseau d'entrée de l'appareil",
  "LogicType.RatioVolatilesInput2": "Le ratio de Volatiles gazeux dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioVolatilesOutput": "Le ratio de Volatiles gazeux dans le réseau de sortie de l'appareil",
  "LogicType.RatioVolatilesOutput2": "Le ratio de Volatiles gazeux dans le réseau de sortie 2 de l'appareil",
  "LogicType.RatioWater": "Le ratio d'Eau liquide dans l'atmosphère de l'appareil",
  "LogicType.RatioWaterInput": "Le ratio d'Eau liquide dans le réseau d'entrée de l'appareil",
  "LogicType.RatioWaterInput2": "Le ratio d'Eau liquide dans le réseau d'entrée 2 de l'appareil",
  "LogicType.RatioWaterOutput": "Le ratio d'Eau liquide dans le réseau de sortie de l'appareil",
  "LogicType.RatioWaterOutput2": "Le ratio d'Eau liquide dans le réseau de sortie 2 de l'appareil",
  "LogicType.ReEntryAltitude": "L'altitude à laquelle la fusée commencera sa descente vers la plateforme.\nDoit être comprise entre 25 km et 120 km.",
  "LogicType.Reagents": "Nombre total de réactifs enregistrés par l'appareil",
  "LogicType.RecipeHash": "Le Hash de la recette que l'appareil est actuellement configuré à produire \n(c'est un identifiant numérique unique pour tous les objets identiques)",
  "LogicType.ReferenceId": "Identifiant de référence unique pour cet objet en particuler, qui commence par \"$\".",
  "LogicType.RequestHash": "Lorsqu'il est configuré sur l'identifiant unique, demande un objet du type spécifié à l'appareil.\n(c'est un identifiant numérique unique pour tous les objets identiques)",
  "LogicType.RequiredPower": "La quantité de puissance de fonctionnement inactive, n'inclut pas nécessairement la puissance demandé supplémentaire",
  "LogicType.ReturnFuelCost": "Obtient le carburant restant dans le réservoir de carburant de votre fusée.",
  "LogicType.Richness": "La richesse du gisement exploitable du site ciblé de la fusée.",
  "LogicType.Rpm": "Le nombre de tours par minute effectués par le mécanisme rotatif de l'appareil",
  "LogicType.SemiMajorAxis": "Le rayon le plus long d'une orbite elliptique en unités astronomiques, mesurant la moitié de l'axe principal. Détermine la taille de l'orbite.",
  "LogicType.Setting": "Un paramètre variable qui peut être lu ou écrit, selon l'appareil",
  "LogicType.SettingInput": "Le réglage d’entrée pour l’appareil",
  "LogicType.SettingOutput": "Le réglage de sortie pour l’appareil",
  "LogicType.SignalID": "Renvoie l'identification du contact avec le signal le plus fort de ce satellite",
  "LogicType.SignalStrength": "Renvoie la puissance du signal le plus fort reçu de satellite",
  "LogicType.Sites": "Le nombre de sites découverts à l'emplacement ciblé sur la carte spatiale de la fusée.",
  "LogicType.Size": "La taille du gisement exploitable du site ciblé de la fusée.",
  "LogicType.SizeX": "Taille selon l'axe X (droite) de l'objet en grandes grilles (une grande grille mesure 2 mètres)",
  "LogicType.SizeY": "Taille selon l'axe Y (haut) de l'objet en grandes grilles (une grande grille mesure 2 mètres)",
  "LogicType.SizeZ": "Taille selon l'axe Z (avant) de l'objet en grandes grilles (une grande grille mesure 2 mètres)",
  "LogicType.SolarAngle": "Angle solaire de l'appareil",
  "LogicType.SolarIrradiance": "L’irradiance solaire actuelle.",
  "LogicType.SoundAlert": "Joue une alerte sonore sur le haut-parleur de l'appareil",
  "LogicType.Stress": "Les machines sont soumises à une contrainte lorsqu'elles travaillent dur. Lorsque la contrainte atteint 100, la machine s'arrête automatiquement",
  "LogicType.Survey": "État d'avancement du scan d'exploration à l'emplacement ciblé sur la carte spatiale de la fusée. Retourne une valeur normalisée où 100 % d'inspection équivaut à 1. Si le scan d'exploration n'est pas disponible, retourne -1.",
  "LogicType.TargetPadIndex": "L'indice de la piste d'atterrissage du commerçant sur le réseau de données de cet appareil qu'il essaiera d'appeler pour faire atterrir un commerçant",
  "LogicType.TargetPrefabHash": "L'objet préfabriqué",
  "LogicType.TargetSlotIndex": "L'index de l'emplacement que l'appareil cible avec lequel cet appareil va essayer d'interagir",
  "LogicType.TargetX": "La position actuelle dans l'axe X en coordonnées du monde",
  "LogicType.TargetY": "La position actuelle dans l'axe Y en coordonnées du monde",
  "LogicType.TargetZ": "La position actuelle dans l'axe Z en coordonnées du monde",
  "LogicType.Temperature": "La température actuelle lu sur l'appareil",
  "LogicType.TemperatureDifferentialEfficiency": "Comment la différence de température entre le tuyau d'entrée et le tuyau de déchets affecte l'efficacité de la machine",
  "LogicType.TemperatureExternal": "La température de l'extérieur de l'appareil, généralement l'atmosphère du monde qui l'entoure",
  "LogicType.TemperatureInput": "La lecture actuelle de la température du réseau d'entrée de l'appareil",
  "LogicType.TemperatureInput2": "La lecture actuelle de la température du réseau d'entrée 2 de l'appareil",
  "LogicType.TemperatureOutput": "Lecture actuelle de la température du réseau de sortie de l'appareil",
  "LogicType.TemperatureOutput2": "Lecture actuelle de la température du réseau de sortie 2 de l'appareil",
  "LogicType.TemperatureSetting": "Le réglage actuel de la température interne de l'objet (par ex. : la climatisation de la combinaison)",
  "LogicType.Throttle": "Augmente le taux de fonctionnement de la machine (plage : 0-100)",
  "LogicType.Thrust": "Poussée totale actuelle de tous les moteurs de la fusée en Newtons.",
  "LogicType.ThrustToWeight": "Rapport poussée/poids de la fusée. Le poids est influencé par la gravité locale. Une fusée avec un faible rapport poussée/poids consommera plus de carburant lors du lancement et de l'atterrissage.",
  "LogicType.Time": "Temps",
  "LogicType.TimeToDestination": "Temps estimé en secondes avant que la fusée n'arrive à destination.",
  "LogicType.TotalMoles": "Renvoie le nombre de moles de l'appareil",
  "LogicType.TotalMolesInput": "Renvoie le nombre total de moles dans le réseau d'entrée de l'appareil",
  "LogicType.TotalMolesInput2": "Renvoie le nombre total de moles dans le réseau d'entrée 2 de l'appareil",
  "LogicType.TotalMolesOutput": "Renvoie le nombre total de moles dans le réseau de sortie de l'appareil",
  "LogicType.TotalMolesOutput2": "Renvoie le nombre total de moles dans le réseau de sortie 2 de l'appareil",
  "LogicType.TotalQuantity": "La quantité totale estimée de ressources disponibles à exploiter sur le site ciblé de la carte spatiale de la fusée.",
  "LogicType.TrueAnomaly": "Un paramètre angulaire qui définit la position d'un corps en orbite képlérienne. C'est l'angle entre la direction du périapside et la position actuelle du corps, vu depuis le foyer principal de l'ellipse (le point autour duquel l'objet orbite).",
  "LogicType.VelocityMagnitude": "La magnitude actuelle du vecteur vitesse",
  "LogicType.VelocityRelativeX": "La vitesse actuelle X par rapport au vecteur avant de cette",
  "LogicType.VelocityRelativeY": "La vitesse actuelle Y par rapport au vecteur avant de cette",
  "LogicType.VelocityRelativeZ": "La vitesse actuelle Z par rapport au vecteur avant de cette",
  "LogicType.VelocityX": "La vitesse de l'entité sur l'axe X dans le monde",
  "LogicType.VelocityY": "La vitesse de l'entité sur l'axe Y dans le monde",
  "LogicType.VelocityZ": "La vitesse de l'entité sur l'axe Z dans le monde",
  "LogicType.Vertical": "Réglage vertical de l'appareil",
  "LogicType.VerticalRatio": "Ratio de réglage vertical pour l'appareil",
  "LogicType.Volume": "Renvoie le volume de l'atmosphère de l'appareil",
  "LogicType.VolumeOfLiquid": "Le volume total de tous les liquides en litres dans l'atmosphère",
  "LogicType.WattsReachingContact": "La quantité de watts atteignant réellement le contact. Cela est influencé par la puissance de l'antenne et la distance hors axe entre l'antenne et le vecteur de contact",
  "LogicType.Weight": "Poids de la fusée en Newtons (y compris le carburant et la cargaison). Le poids est influencé par la gravité locale.",
  "LogicType.WorkingGasEfficiency": "L'efficacité du gaz de travail rapportée par la machine, sous forme d'un nombre flottant entre 0 et 1",
  "abs": "Registre = la valeur absolue de a",
  "acos": "Registe = le cosinus de l'angle a (en radians)",
  "add": "Registre = a + b",
  "alias": "Étiquette le registre ou la référence de l'appareil avec un nom, les références d'appareils affectent également ce qui s'affiche sur les vis du support IC10 (d?).",
  "and": "Effectue une opération logique \"AND\" (ET) : le registre de sortie = 1 uniquement si tous les bits d'entrée sont 1. Sinon, le registre de sortie = 0.",
  "asin": "Registe = l'angle (en radians) dont le sinus est a",
  "atan": "Registe = l'angle (en radians) dont la tangente est a",
  "atan2": "Registe = l'angle (en radians) dont la tangente est le quotient des deux : a(y) et b(x)",
  "bap": "Saute à la ligne d si abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8) (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "bapal": "Saute à la ligne c si a != b et stocke le numéro de la ligne suivante dans ra",
  "bapz": "Saute à la ligne b si abs(a) <= float.epsilon \\* 8 (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "bapzal": "Saute à la ligne c si abs(a) <= float.epsilon \\* 8 et stocke le numéro de la ligne suivante dans ra (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "bdns": "Saute à la ligne a si l'appareil n'est pas configuré. L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "bdnsal": "Saute à la ligne a si l'appareil n'est pas configuré et stocke le numéro de la ligne suivante dans ra. L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "bdse": "Saute à la ligne a si l'appareil est configuré. L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "bdseal": "Saute à la ligne a si l'appareil est configuré et stocke le numéro de la ligne suivante dans ra. L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "beq": "Saute à la ligne c si a == b",
  "beqal": "Saute à la ligne c si a == b et stocke le numéro de la ligne suivante dans ra",
  "beqz": "Saute à la ligne b si a == 0",
  "beqzal": "Saute à la ligne b si a == 0 et stocke le numéro de la ligne suivante dans ra",
  "bge": "Saute à la ligne c si a >= b",
  "bgeal": "Saute à la ligne c si a >= b et stocke le numéro de la ligne suivante dans ra",
  "bgez": "Saute à la ligne b si a >= 0",
  "bgezal": "Saute à la ligne b si a >= 0 et stocke le numéro de la ligne suivante dans ra",
  "bgt": "Saute à la ligne c si a > b",
  "bgtal": "Saute à la ligne c si a > b et stocke le numéro de la ligne suivante dans ra",
  "bgtz": "Saute à la ligne b si a > 0",
  "bgtzal": "Saute à la ligne b si a > 0 et stocke le numéro de la ligne suivante dans ra",
  "ble": "Saute à la ligne c si a <= b",
  "bleal": "Saute à la ligne c si a <= b et stocke le numéro de la ligne suivante dans ra",
  "blez": "Saute à la ligne b si a <= 0",
  "blezal": "Saute à la ligne b si a <= 0 et stocke le numéro de la ligne suivante dans ra",
  "blt": "Saute à la ligne c si a < b",
  "bltal": "Saute à la ligne c si a < b et stocke le numéro de la ligne suivante dans ra",
  "bltz": "Saute à la ligne b si a < 0",
  "bltzal": "Saute à la ligne b si a < 0 et stocke le numéro de la ligne suivante dans ra",
  "bna": "Saute à la ligne d si abs(a - b) > max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8) (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "bnaal": "Saute à la ligne d si abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8) et stocke le numéro de la ligne suivante dans ra (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "bnan": "Saute à la ligne b si a n'est pas un nombre (NaN)",
  "bnaz": "Saute à la ligne b si abs(a) > float.epsilon (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "bnazal": "Saute à la ligne c si abs(a) > float.epsilon \\* 8 et stocke le numéro de la ligne suivante dans ra (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "bne": "Saute à la ligne c si a != b",
  "bneal": "Saute à la ligne c si a != b et stocke le numéro de la ligne suivante dans ra",
  "bnez": "Saute à la ligne b si a != 0",
  "bnezal": "Saute à la ligne b si a != 0 et stocke le numéro de la ligne suivante dans ra",
  "brap": "Fait un saut relatif de d lignes si abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8) (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "brapz": "Fait un saut relatif de c lignes si abs(a) <= float.epsilon \\* 8 (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "brdns": "Fait un saut relatif de a lignes si l'appareil n'est pas configuré L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "brdse": "Fait un saut relatif de a lignes si l'appareil est configuré L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "breq": "Fait un saut relatif de c lignes si a == b",
  "breqz": "Fait un saut relatif de b lignes si a == 0",
  "brge": "Fait un saut relatif de c lignes si a >= b",
  "brgez": "Fait un saut relatif de b lignes si a >= 0",
  "brgt": "Fait un saut relatif de c lignes si a > b",
  "brgtz": "Fait un saut relatif de b lignes si a > 0",
  "brle": "Fait un saut relatif de c lignes si a <= b",
  "brlez": "Fait un saut relatif de b lignes si a <= 0",
  "brlt": "Fait un saut relatif de c lignes si a < b",
  "brltz": "Fait un saut relatif de b lignes si a < 0",
  "brna": "Fait un saut relatif de d lignes si abs(a - b) > max(c \\* max (abs(a), abs(b)), float.epsilon \\* 8) (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "brnan": "Fait un saut relatif de b lignes si a n'est pas un nombre (NaN)",
  "brnaz": "Fait un saut relatif de c lignes si abs(a) > float.epsilon \\* 8 (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "brne": "Fait un saut relatif de c lignes si a != b",
  "brnez": "Fait un saut relatif de b lignes si a != 0",
  "ceil": "Register = plus petit entier supérieur ou égal à a",
  "clr": "Efface la mémoire du tableau de l'appareil en utilisant la valeur d'index du support IC10 (d?).",
  "clrd": "Efface la mémoire du tableau de l'appareil en utilisant directement l'ID. (IDentifiant unique de cet objet en particulier, qui commence par \"$\").",
  "cos": "Registe = le cosinus de l'angle a (en radians)",
  "define": "Crée une étiquette qui sera remplacée dans tout le programme par la valeur fournie.",
  "div": "Registre = a / b",
  "exp": "Registre = exp(a)",
  "floor": "Register = plus grand entier inférieur ou égal à a",
  "get": "Registre = valeur du tableau à l'adresse fournie de l'appareil en utilisant la valeur d'index du support IC10 (d?).",
  "getd": "Registre = valeur du tableau à l'adresse fournie d’un appareil qui est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "hcf": "Arrêt et prise de feu",
  "j": "Saute à la ligne a",
  "jal": "Saute à la ligne a et stocke le numéro de la ligne suivante dans ra",
  "jr": "Fait un saut relatif de a lignes",
  "l": "Registre = la valeur logique (logicType) en utilisant la référence d’un appareil qui est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "label": "OBSOLÈTE",
  "lb": "Registre = la valeur logique (logicType) de tous les appareils réseau qui correspondent au type du Hash en utilisant le mode groupé indiqué : 0 = Moyenne (Average), 1 = Somme (Sum), 2 = Minimum (Minimum), 3 = Maximum (Maximum).  Peut utiliser soit le chiffre, soit le mot (en anglais).",
  "lbn": "Registre = la valeur logique (logicType) de tous les appareils réseau qui correspondent au type du Hash et au nom fournis en utilisant le mode groupé indiqué : 0 = Moyenne (Average), 1 = Somme (Sum), 2 = Minimum (Minimum), 3 = Maximum (Maximum).  Peut utiliser soit le chiffre, soit le mot (en anglais).",
  "lbns": "Registre = la valeur \"logique par emplacements\" (logicSlotType) depuis le \"numéro d'index de l’emplacement\" (slotIndex) de tous les appareils réseau qui correspondent au type du Hash et au nom fournis en utilisant le mode groupé indiqué : 0 = Moyenne (Average), 1 = Somme (Sum), 2 = Minimum (Minimum), 3 = Maximum (Maximum).  Peut utiliser soit le chiffre, soit le mot (en anglais).",
  "lbs": "Registre = la valeur \"logique par emplacements\" (logicSlotType) depuis le \"numéro d'index de l’emplacement\" (slotIndex) de tous les appareils réseau qui correspondent au type du Hash en utilisant le mode groupé indiqué : 0 = Moyenne (Average), 1 = Somme (Sum), 2 = Minimum (Minimum), 3 = Maximum (Maximum).  Peut utiliser soit le chiffre, soit le mot (en anglais).",
  "ld": "Registre = la valeur logique (logicType) en utilisant la référence directe à l'ID  (IDentifiant unique de cet objet en particulier, qui commence par \"$\").",
  "log": "Registre = log(a)",
  "lr": "Registre = le type de réactif (ReagentMode) de l'appareil où un Hash du type de réactif est vérifié. Le type de réactif peut être soit :  0 = Contenu (Contents), 1 = Requis (Required), 2 = Recette (Recipe).  Peut utiliser soit le chiffre, soit le mot (en anglais).  L'appareil est definie soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "ls": "Registre = le type de \"logique par emplacements\" (logicSlotType) depuis le \"numéro d'index de l’emplacement\" (slotIndex) d’un appareil qui est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "max": "Registre = la valeur maximum entre a et b",
  "min": "Registre = la valeur minimum entre a et b",
  "mod": "Registre = a mod b (note : différent de a % b)",
  "move": "Registre = numéro fourni ou valeur du registre.",
  "mul": "Registre = a \\* b",
  "nor": "Effectue une opération logique \"NOR\" (NON OU) : le registre de sortie = 1 uniquement si tous les bits d'entrée sont 0. Sinon, le registre de sortie = 0.",
  "not": "Effectue une opération logique \"NOT\" (NON) : le registre de sortie = l'inverse du bit de la valeur d'entrée. Si le bit est 0, il devient 1, et vice versa.",
  "or": "Effectue une opération logique \"OR\" (OU) : le registre de sortie = 1 si au moins un bit d'entrée est 1. Sinon, le registre de sortie = 0.",
  "peek": "Registre = la valeur en haut du tableau",
  "poke": "Stocke la valeur fournie à l'adresse fournie dans le tableau.",
  "pop": "Registre = la valeur en haut du tableau et décrémente sp (sp c'est le registre contenant l'index du tableau, entre 0 et 512)",
  "push": "Ajoute la valeur de a en haut du tableau et incrémente sp (sp c'est le registre contenant l'index du tableau, entre 0 et 512)",
  "put": "Stocke la valeur dans le tableau à l'adresse fournie d’un appareil qui est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "putd": "Stocke la valeur dans le tableau à l'adresse fournie de l'appareil en utilisant directement l'ID. (IDentifiant unique de cet objet en particulier, qui commence par \"$\").",
  "rand": "Registre = une valeur aléatoire x avec 0 <= x < 1",
  "rmap": "Étant donné un Hash de réactif, stocke le Hash du préfabriqué correspondant que l'appareil attend pour satisfaire l'exigence du réactif. Par exemple, sur une imprimante automatique, le Hash pour Fer stockera le Hash pour ItemIronIngot (lingot de fer).",
  "round": "Register = a arrondi à l'entier le plus proche",
  "s": "Stocke la valeur du registre dans la valeur logique (logicType) d’un appareil qui est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "sap": "Registre = 1 si abs(a - b) <= max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8), sinon 0 (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "sapz": "Registre = 1 si abs(a) <= float.epsilon \\* 8, sinon 0 (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "sb": "Stocke la valeur du registre dans la valeur logique (logicType) de tous les appareils réseau qui correspondent au type du Hash.",
  "sbn": "Stocke la valeur du registre dans la valeur logique (logicType) sur tous les appareils réseau de sortie avec le Hash de type et le nom fournis.",
  "sbs": "Stocke la valeur du registre dans la valeur \"logique par emplacements\" (logicSlotType) depuis le \"numéro d'index de l’emplacement\" (slotIndex) de tous les appareils réseau qui correspondent au type du Hash.",
  "sd": "Stocke la valeur du registre dans la valeur logique (logicType) de l'appareil en utilisant sa référence directe à l'ID (IDentifiant unique de cet objet en particulier, qui commence par \"$\").",
  "sdns": "Registre = 1 si l'appareil n'est pas configuré, sinon 0 L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "sdse": "Registre = 1 si l'appareil est configuré, sinon 0 L'appareil est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "select": "Registre = b si a est non nul, sinon c",
  "seq": "Registre = 1 si a == b, sinon 0",
  "seqz": "Registre = 1 si a == 0, sinon 0",
  "sge": "Registre = 1 si a >= b, sinon 0",
  "sgez": "Registre = 1 si a >= 0, sinon 0",
  "sgt": "Registre = 1 si a > b, sinon 0",
  "sgtz": "Registre = 1 si a > 0, sinon 0",
  "sin": "Registe = le sinus de l'angle a (en radians)",
  "sla": "Effectue une opération de décalage arithmétique vers la gauche sur la représentation binaire d'une valeur. Elle décale les bits vers la gauche et remplit les bits les plus à droite vides avec une copie du bit de signe (le bit le plus significatif).",
  "sle": "Registre = 1 si a <= b, sinon 0",
  "sleep": "Pause de l'exécution pendant a secondes",
  "slez": "Registre = 1 si a <= 0, sinon 0",
  "sll": "Effectue une opération de décalage logique vers la gauche sur la représentation binaire d'une valeur. Elle décale les bits vers la gauche et remplit les bits les plus à droite vides avec des zéros.",
  "slt": "Registre = 1 si a < b, sinon 0",
  "sltz": "Registre = 1 si a < 0, sinon 0",
  "sna": "Registre = 1 si abs(a - b) > max(c \\* max(abs(a), abs(b)), float.epsilon \\* 8), sinon 0 (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "snan": "Registre = 1 si a est NaN, sinon 0",
  "snanz": "Registre = 0 si a est NaN, sinon 1",
  "snaz": "Registre = 1 si abs(a) > float.epsilon, sinon 0 (float.epsilon représente la plus petite différence entre deux nombres flottants distincts. C'est essentiellement la précision minimale ou la tolérance au-delà de laquelle les nombres flottants sont considérés comme différents)",
  "sne": "Registre = 1 si a != b, sinon 0",
  "snez": "Registre = 1 si a != 0, sinon 0",
  "sqrt": "Registre = racine carrée de a",
  "sra": "Effectue une opération de décalage arithmétique vers la droite sur la représentation binaire d'une valeur. Elle décale les bits vers la droite et remplit les bits les plus à gauche vides avec une copie du bit de signe (le bit le plus significatif).",
  "srl": "Effectue une opération de décalage logique vers la droite sur la représentation binaire d'une valeur. Elle décale les bits vers la droite et remplit les bits les plus à gauche vides avec des zéros.",
  "ss": "Stocke la valeur du registre dans la valeur \"logique par emplacements\" (logicSlotType) depuis le \"numéro d'index de l’emplacement\" (slotIndex) d’un appareil qui est defini soit par :  - la valeur d’index du support IC10 (d?)  - un registre (r?)  - la référence directe à l’ID (identifiant unique de cet objet en particulier, qui commence par \"$\").",
  "sub": "Registre = a - b",
  "tan": "Registe = la tangente de l'angle a (en radians)",
  "trunc": "Register = a sans la partie décimale (entier obtenu par troncature)",
  "xor": "Effectue une opération logique \"XOR\" (OU exclusif) : le registre de sortie = 1 si une seule des entrées est 1. Si les entrées sont identiques, le registre de sortie = 0.",
  "yield": "Pause de l'exécution pour 1 cycle de 0,5 seconde (tick)"
}